# Seconds Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Seconds Property
UnitTypeId Class See Also
---
Seconds.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Seconds { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Seconds As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Seconds {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace